//char//字符数字类型
//short//短整型
//int//整形
//long//长整型
//float//单精度浮点数【浮点数为小数】
//double//双精度浮点数
//char ch=//申请内存，等号后面是要储存的东西
//%c//代表打印字符
//eg://printf("%c\n",ch)
//%d//代表打印整形十进制数据
//%f//代表浮点型数据
//当打印时eg:float f = 5.0
//printf("%f\n", f)
//计算机中的单位，bit（比特位）最小单位
//byte（字节）
//1个字节 = 8个比特位
//1kb = 1024byte   1mb = 1024kb
//正电-1  负电-0
//char-1个字节  short-2个字节  int-4个字节   long-4个或8个字节  longlong-8个字节
//float - 4个字节  double - 8个字节
//全局变量：定义在代码块{}之外的变量
//局部变量：定义在代码块{}内部的变量
//局部变量和全局变量的名字建议不要相同，容易产生bug。
//当局部变量和全局变量名字相同时，局部变量优先
//scanf-输入数据，使用输入函数scanf 
//eg：scanf("%d%d", &num1, &num2);//要求多个变量相加的时候，变量前都要加&
//c语言语法规定，变量要定义在当前代码块的最前面
//未声明的标识符，用extern外部符号的
//生命周期：变量存在的时间
